HirokiIshiguro/iot-reference-rx/Projects/aws_bg96_ck_rx65n_tsip/e2studio_ccrx/src/smc_gen/r_cellular/src/private/private_api/include/cellular_private_api.h
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2024 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : cellular_private_api.h
 * Description  : Configures the driver.
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include <stdint.h>
#include <stdbool.h>
#include "r_cellular_if.h"

#ifndef CELLULAR_PRIVATE_API_H
#define CELLULAR_PRIVATE_API_H

/**********************************************************************************************************************
 * Macro definitions
 *********************************************************************************************************************/
#ifndef CELLULAR_CFG_UART_SCI_CH
#error "Error! Need to define CELLULAR_CFG_UART_SCI_CH in cellular_config.h"
#elif CELLULAR_CFG_UART_SCI_CH == (0)
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
/* Store R_SCI_PinSet_SCI0() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI0())
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
/*  */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()
#endif
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH0)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH0_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH0_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (1)
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
/* Store R_SCI_PinSet_SCI1() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI1())
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
/* Emptying R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()
#endif
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH1)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH1_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH1_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (2)
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
/* Store R_SCI_PinSet_SCI2() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI2())
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
/* Emptying R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()
#endif
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH2)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH2_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH2_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (3)
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
/* Store R_SCI_PinSet_SCI3() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI3())
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
/* Emptying R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()
#endif
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH3)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH3_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH3_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (4)
/* Store R_SCI_PinSet_SCI4() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI4())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH4)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH4_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH4_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (5)
/* Store R_SCI_PinSet_SCI5() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI5())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH5)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH5_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH5_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (6)
/* Store R_SCI_PinSet_SCI6() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI6())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH6)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH6_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH6_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (7)
/* Store R_SCI_PinSet_SCI7() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI7())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH7)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH7_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH7_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (8)
/* Store R_SCI_PinSet_SCI8() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI8())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH8)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH8_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH8_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (9)
/* Store R_SCI_PinSet_SCI9() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI9())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH9)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH9_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH9_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (10)
/* Store R_SCI_PinSet_SCI10() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI10())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH10)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH10_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH10_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (11)
/* Store R_SCI_PinSet_SCI11() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI11())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH11)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH11_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH11_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (12)
/* Store R_SCI_PinSet_SCI12() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI12())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH12)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH12_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH12_RX_BUFSIZ)
#else
#error "Error! Invalid setting for CELLULAR_UART_SCI_CH in cellular_config.h"
#endif /* CELLULAR_CFG_UART_SCI_CH */

#if R_SCI_CFG_TX_BUFSIZE < (2048)
#error "The SCI send buffer size is too small."
#endif
#if R_SCI_CFG_RX_BUFSIZE < (2048)
#error "The SCI receive buffer size is too small."
#endif
/*
 * The r_cellular SCI callback does not call FreeRTOS APIs. Allow its interrupt
 * priority to run above configMAX_SYSCALL_INTERRUPT_PRIORITY so UART RX is not
 * masked by kernel critical sections at high baud rates.
 */

/**********************************************************************************************************************
 * Exported global variables
 *********************************************************************************************************************/
extern st_cellular_ctrl_t * gp_cellular_ctrl;

/*****************************************************************************
 * Private Functions
 *****************************************************************************/
/****************************************************************************
 * Function Name  @fn            cellular_power_down
 * Description    @details       Stop the power supply to the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully initialized the serial communication function.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***************************************************************************/
e_cellular_err_t cellular_power_down (st_cellular_ctrl_t * const p_ctrl);

/**********************************************************************************************
 * Function Name  @fn            cellular_serial_open
 * Description    @details       Initializing the serial communication function.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully initialized the serial communication function.
 *                @retval        CELLULAR_ERR_SERIAL_OPEN -
 *                                  Serial initialization failed.
 *********************************************************************************************/
e_cellular_err_t cellular_serial_open (st_cellular_ctrl_t * const p_ctrl);

/**********************************************************************************************
 * Function Name  @fn            cellular_serial_close
 * Description    @details       Terminate the serial communication function.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *********************************************************************************************/
void cellular_serial_close (st_cellular_ctrl_t * const p_ctrl);

/**********************************************************************************************
 * Function Name  @fn            cellular_serial_reopen
 * Description    @details       Close and reopen the serial port at a new baud rate.
 *                               Used by the BG96 boot-time baud upgrade (115200 -> 921600).
 *                               The receive task tolerates the brief SCI handle transition
 *                               because its main loop yields on R_SCI_Receive failure.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure (baud_rate field is updated).
 *                @param[in]     new_baud -
 *                                  Target baud rate, in bits per second.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Serial port reopened at the new baud rate.
 *                @retval        CELLULAR_ERR_SERIAL_OPEN -
 *                                  R_SCI_Open failed after close.
 *********************************************************************************************/
e_cellular_err_t cellular_serial_reopen (st_cellular_ctrl_t * const p_ctrl, uint32_t new_baud);

/**********************************************************************************************
 * Function Name  @fn            cellular_serial_enable_cts
 * Description    @details       Enable SCI CTS after the modem accepts hardware flow-control setup.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  CTS input enabled or not required.
 *********************************************************************************************/
e_cellular_err_t cellular_serial_enable_cts (st_cellular_ctrl_t * const p_ctrl);

/****************************************************************************
 * Function Name  @fn            cellular_semaphore_init
 * Description    @details       Initialize the semaphore function.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully semaphore initialization.
 *                @retval        CELLULAR_ERR_SEMAPHORE_INIT -
 *                                  Failed to initialize the semaphore.
 ***************************************************************************/
e_cellular_err_t cellular_semaphore_init (st_cellular_ctrl_t * const p_ctrl);

/****************************************************************************
 * Function Name  @fn            cellular_socket_init
 * Description    @details       Send AT command to the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully Socket initialization.
 *                @retval        CELLULAR_ERR_BYTEQ_OPEN -
 *                                  Failed to initialize the byte queue.
 ***************************************************************************/
e_cellular_err_t cellular_socket_init (st_cellular_ctrl_t * const p_ctrl);

