HirokiIshiguro/iot-reference-rx/Projects/aws_bg96_ck_rx65n_tsip/e2studio_ccrx/src/smc_gen/r_cellular/src/private/private_api/include/cellular_private_api.h
/*******************************************************************************
 * Function Name  @fn            cellular_rts_ctrl
 * Description    @details       Controls the RTS Pin.
 * Arguments      @param[in]     lowhigh -
 *                                  Control direction.
 ******************************************************************************/
void cellular_rts_ctrl (const uint8_t lowhigh);

/*******************************************************************************
 * Function Name  @fn            cellular_rts_hw_flow_enable
 * Description    @details       Enable hardware flow.
 ******************************************************************************/
void cellular_rts_hw_flow_enable (void);

/*******************************************************************************
 * Function Name  @fn            cellular_rts_hw_flow_disable
 * Description    @details       Disable hardware flow.
 ******************************************************************************/
void cellular_rts_hw_flow_disable (void);

/***********************************************************************************************
 * Function Name  @fn            cellular_recv_task
 * Description    @details       Process incoming data from the module.
 * Arguments      @param[in/out] p_pvParameters -
 *                                  Pointer to the parameter given at the time of task creation.
 **********************************************************************************************/
#if BSP_CFG_RTOS_USED == (1)
void cellular_recv_task (void * p_pvParameters);
#elif BSP_CFG_RTOS_USED == (5)
void cellular_recv_task (ULONG p_pvParameters);
#endif

/**************************************************************************************************************
 * Function Name  @fn            cellular_ring_task
 * Description    @details       Control of the RTS terminal in accordance with the operation of the RING line.
 * Arguments      @param[in/out] p_pvParameters -
 *                                  Pointer to the parameter given at the time of task creation.
 *************************************************************************************************************/
#if BSP_CFG_RTOS_USED == (1)
void cellular_ring_task (void * p_pvParameters);
#elif BSP_CFG_RTOS_USED == (5)
void cellular_ring_task (ULONG p_pvParameters);
#endif

/****************************************************************************
 * Function Name  @fn            cellular_start_recv_task
 * Description    @details       Start receiving task.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully executed AT command.
 *                @retval        CELLULAR_ERR_EVENT_GROUP_INIT -
 *                                  Failed to initialize the event group.
 *                @retval        CELLULAR_ERR_CREATE_TASK -
 *                                  Failed to create task.
 ***************************************************************************/
e_cellular_err_t cellular_start_recv_task (st_cellular_ctrl_t * const p_ctrl);

/****************************************************************************
 * Function Name  @fn            cellular_start_ring_task
 * Description    @details       Start RING Line task.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully executed AT command.
 *                @retval        CELLULAR_ERR_EVENT_GROUP_INIT -
 *                                  Failed to initialize the event group.
 *                @retval        CELLULAR_ERR_CREATE_TASK -
 *                                  Failed to create task.
 ***************************************************************************/
e_cellular_err_t cellular_start_ring_task (st_cellular_ctrl_t * const p_ctrl);

/****************************************************************************
 * Function Name  @fn            cellular_start_monitor_task
 * Description    @details       Start monitor task.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully executed AT command.
 *                @retval        CELLULAR_ERR_EVENT_GROUP_INIT -
 *                                  Failed to initialize the event group.
 *                @retval        CELLULAR_ERR_CREATE_TASK -
 *                                  Failed to create task.
 ***************************************************************************/
e_cellular_err_t cellular_start_monitor_task (st_cellular_ctrl_t * const p_ctrl);

/****************************************************************************
 * Function Name  @fn            cellular_set_atc_number
 * Description    @details       Stores the AT command number being executed.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     command -
 *                                  Running AT command number.
 ***************************************************************************/
void cellular_set_atc_number (st_cellular_ctrl_t * const p_ctrl, const e_atc_list_t command);

/****************************************************************************
 * Function Name  @fn            cellular_get_atc_response
 * Description    @details       Get the response from the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Arguments      @param[in]     command -
 *                                  Running AT command number.
 * Return Value   @retval        ATC_RETURN_NONE -
 *                                  No response from the module.
 *                @retval        ATC_RETURN_OK -
 *                                  Module response is "OK".
 *                @retval        ATC_RETURN_ERROR -
 *                                  Module response is "ERROR".
 *                @retval        ATC_RETURN_OK_GO_SEND -
 *                                  Module response is ">".
 *                @retval        ATC_RETURN_SEND_NO_CARRIER -
 *                                  Module response is "NO CARRIER".
 *                @retval        ATC_RETURN_AP_CONNECTING -
 *                                  Module response is "CONNECT".
 *************************************************************************/
e_cellular_atc_return_t cellular_get_atc_response (st_cellular_ctrl_t * const p_ctrl);

/*************************************************************************************
 * Function Name  @fn            cellular_execute_at_command
 * Description    @details       Send AT command to the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     timeout_ms -
 *                                  Timeout millisecond.
 *                @param[in]     expect_code -
 *                                  Response expectancy.
 *                @param[in]     command -
 *                                  Running AT command number.
 * Return Value   @retval        CELLULAR_ATC_OK -
 *                                  Successfully executed AT command.
 *                @retval        CELLULAR_ATC_ERR_PARAMETER -
 *                                  Argument is abnormal.
 *                @retval        CELLULAR_ATC_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ATC_ERR_COMPARE -
 *                                  The return value from the module is disappointing.
 *                @retval        CELLULAR_ATC_ERR_TIMEOUT -
 *                                  Time out.
 ************************************************************************************/
e_cellular_err_t cellular_execute_at_command (st_cellular_ctrl_t * const p_ctrl, const uint32_t timeout_ms,
                                                        const e_cellular_atc_return_t expect_code,
                                                                const e_atc_list_t command);

/****************************************************************************************
 * Function Name  @fn            cellular_smcwrx
 * Description    @details       Starts a downlink continuous wave service.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     earfcn -
 *                                  An E-UTRA Absolute Radio Frequency Channel Number.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully executed AT command.
 *                @retval        CELLULAR_ATC_ERR_MODULE_COM -
 *                                  Communication with module failed.
 ***************************************************************************************/
e_cellular_err_t cellular_smcwrx (st_cellular_ctrl_t * const p_ctrl, const uint16_t earfcn);

