HirokiIshiguro/iot-reference-rx/Projects/aws_bg96_ck_rx65n_tsip/e2studio_ccrx/src/smc_gen/r_cellular/src/private/private_api/include/cellular_private_api.h
/**************************************************************************************************************
 * Function Name  @fn            cellular_smcwtx
 * Description    @details       Starts an uplink continuous wave service.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     enable -
 *                                  1 to start; 0 to stop.
 *                @param[in]     earfcn -
 *                                  An E-UTRA Absolute Radio Frequency Channel Number.
 *                @param[in]     level -
 *                                  RF output power level of the continuous wave signal, in hundredths of dBm.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully executed AT command.
 *                @retval        CELLULAR_ATC_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *************************************************************************************************************/
e_cellular_err_t cellular_smcwtx (st_cellular_ctrl_t * const p_ctrl, const uint8_t enable,
                                    const uint16_t earfcn, const int32_t level);

/**************************************************************************************************************
 * Function Name  @fn            cellular_getpdpaddr
 * Description    @details       Stores the obtained PDP address in the structure.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in/out] p_addr -
 *                                  Pointer to structure to store address.
 *************************************************************************************************************/
void cellular_getpdpaddr (st_cellular_ctrl_t * const p_ctrl, st_cellular_ipaddr_t * const p_addr);

#endif /* CELLULAR_PRIVATE_API_H */
